app/controllers/carted_products_controller.rb

SELECT "carted_products".* FROM "carted_products" WHERE "carted_products"."user_id" = $1 AND "carted_products"."status" = $2  [["user_id", 9], ["status", "carted"]]
---
  def index
    @carted_products = current_user.carted_products.where(status:"carted")

INSERT INTO "carted_products" ("user_id", "product_id", "quantity", "status", "order_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 9], ["product_id", 110], ["quantity", 2], ["status", "wait"], ["order_id", 1], ["created_at", "2018-02-04 05:42:52.546027"], ["updated_at", "2018-02-04 05:42:52.546027"]]
---
  def create
    status = "carted"
    @carted_product = CartedProduct.new(
        user_id:current_user.id,
        product_id: params['product_id'],
        quantity: params['quantity'],
        order_id:params['order_id'],
        status:status
      )
    if @carted_product.save