app/controllers/orders_controller.rb

  def index
    # @orders = Order.all
    @orders = current_user.orders
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 9]]

  def create
    carted_products = current_user.carted_products.where(status:"carted")

    subtotal = 0
    carted_products.each do |carted_product|
      subtotal += carted_product.product.price * carted_product.quantity
    end
    tax = subtotal * 0.09
    total = tax + subtotal
    @order = Order.new(
        user_id:current_user.id,
        subtotal:subtotal,
        tax: tax,
        total: total
      )
    @order.save
    carted_products.each {|carted_product| carted_product.update(status:"purchased",order_id:@order.id)}
---
SELECT "carted_products".* FROM "carted_products" WHERE "carted_products"."user_id" = $1 AND "carted_products"."status" = $2  [["user_id", 9], ["status", "carted"]]
INSERT INTO "orders" ("user_id", "subtotal", "tax", "total", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 9], ["subtotal", "382490712.0"], ["tax", "34424164.08"], ["total", "416914876.08"], ["created_at", "2018-02-04 18:17:23.374803"], ["updated_at", "2018-02-04 18:17:23.374803"]]
UPDATE "carted_products" SET "status" = $1, "order_id" = $2, "updated_at" = $3 WHERE "carted_products"."id" = $4  [["status", "purchased"], ["order_id", 6], ["updated_at", "2018-02-04 18:17:23.387860"], ["id", 2]]