app/controllers/orders_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 110], ["LIMIT", 1]]
---
  def create
    subtotal = Product.find(params[:product_id]).price * params[:quantity].to_i