app/controllers/products_controller.rb

  def all_products_method
    products = Product.all
---
SELECT "products".* FROM "products"

  def first_product_method
    first_product = Product.first
---
SELECT  "products".* FROM "products" ORDER BY "products"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def index
    @products = Product.all
    search = params[:search]
    sort = params[:sort]
    if search
      @products = @products.where("name iLIKE ?","%#{search}%")
    end
    if sort
      @products = @products.order(sort => :asc)
    end
    category_name = params[:category]
    if category_name
      @products = Category.find_by(name:category_name).products
---
SELECT "products".* FROM "products" WHERE (name iLIKE '%Zipora%')
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT $2  [["name", "woo"], ["LIMIT", 1]]

  def create
    # if current_user && current_user.admin
      @product = Product.new(
        name:params[:name],
        price:params[:price],
        description:params[:description],
        in_stock:params[:in_stock],
        supplier_id: params[:supplier_id]

      )
      if @product.save
---
INSERT INTO "products" ("name", "price", "image_url", "description", "created_at", "updated_at", "in_stock") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "new"], ["price", "10.1"], ["image_url", "dfssa"], ["description", "dsaf"], ["created_at", "2018-01-23 02:31:00.274138"], ["updated_at", "2018-01-23 02:31:00.274138"], ["in_stock", "t"]]

  def show
    @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    # if current_user && current_user.admin
      @product = Product.find(params[:id])
      @product.name = params[:name] || @product.name
      @product.price = params[:price] || @product.price
      @product.description = params[:description] || @product.description
      @product.in_stock = params[:in_stock] || @product.in_stock
      if @product.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "name" = $1, "price" = $2, "image_url" = $3, "description" = $4, "updated_at" = $5 WHERE "products"."id" = $6  [["name", "as"], ["price", 234], ["image_url", "asd"], ["description", "sd"], ["updated_at", "2018-01-19 02:56:44.847986"], ["id", 1]]

  def destroy
    # if current_user && current_user.admin
      @product = Product.find(params[:id])
      @product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]