app/controllers/suppliers_controller.rb

SELECT "suppliers".* FROM "suppliers"
---
  def index
    @suppliers = Supplier.all

SELECT  "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @supplier = Supplier.find(params[:id])