app/views/suppliers/show.json.jbuilder

json.phone_number @supplier.phone_number
json.product_names @supplier.product.map{|product| product.name}
---
SELECT "products".* FROM "products" WHERE "products"."supplier_id" = $1  [["supplier_id", 1]]